In [1]:
import pandas as pd

In [2]:
labels = "python","dbms","dsa"
data=23 , 56,78
marks=pd.Series(data,labels)

In [3]:
marks

python    23
dbms      56
dsa       78
dtype: int64

In [4]:
type(marks)

pandas.core.series.Series

In [5]:
d={"name":"siya" , "course":"bca" , "address":"vadodra"}
pd.Series(d)

name          siya
course         bca
address    vadodra
dtype: object

In [6]:
marks.keys()

Index(['python', 'dbms', 'dsa'], dtype='object')

In [7]:
marks.values

array([23, 56, 78], dtype=int64)

In [8]:
import numpy as np

In [9]:
df=pd.DataFrame(np.random.randint(1,100,(4,3)),index=["riya","siya","kiya","jiya"],columns=["python","data science","dbms"])

In [10]:
df

      python  data science  dbms
riya      88            16    72
siya      28            84    80
kiya       5            14    45
jiya      78            47    45

In [11]:
df[['python','data science']]

      python  data science
riya      88            16
siya      28            84
kiya       5            14
jiya      78            47

In [12]:
df['total']=df['python']+df['data science']+df['dbms']

In [13]:
df

      python  data science  dbms  total
riya      88            16    72    176
siya      28            84    80    192
kiya       5            14    45     64
jiya      78            47    45    170

In [14]:
df['percentage']=df['python']+df['data science']+df['dbms']*3/100
df

      python  data science  dbms  total  percentage
riya      88            16    72    176      106.16
siya      28            84    80    192      114.40
kiya       5            14    45     64       20.35
jiya      78            47    45    170      126.35

In [15]:
df.loc['riya']

python           88.00
data science     16.00
dbms             72.00
total           176.00
percentage      106.16
Name: riya, dtype: float64

In [16]:
df.loc[['riya','siya']]

      python  data science  dbms  total  percentage
riya      88            16    72    176      106.16
siya      28            84    80    192      114.40

In [17]:
df.head(3)

      python  data science  dbms  total  percentage
riya      88            16    72    176      106.16
siya      28            84    80    192      114.40
kiya       5            14    45     64       20.35

In [18]:
df.tail(3)

      python  data science  dbms  total  percentage
siya      28            84    80    192      114.40
kiya       5            14    45     64       20.35
jiya      78            47    45    170      126.35

In [19]:
df.iloc[1]

python           28.0
data science     84.0
dbms             80.0
total           192.0
percentage      114.4
Name: siya, dtype: float64

In [20]:
df.drop("total",axis=1)

      python  data science  dbms  percentage
riya      88            16    72      106.16
siya      28            84    80      114.40
kiya       5            14    45       20.35
jiya      78            47    45      126.35

In [21]:
df

      python  data science  dbms  total  percentage
riya      88            16    72    176      106.16
siya      28            84    80    192      114.40
kiya       5            14    45     64       20.35
jiya      78            47    45    170      126.35

In [22]:
df.drop("total",axis=1,inplace=True)

In [23]:
df

      python  data science  dbms  percentage
riya      88            16    72      106.16
siya      28            84    80      114.40
kiya       5            14    45       20.35
jiya      78            47    45      126.35

In [24]:
df.drop('riya',axis=0,inplace=True)
df

      python  data science  dbms  percentage
siya      28            84    80      114.40
kiya       5            14    45       20.35
jiya      78            47    45      126.35

In [25]:
import pandas as pd

In [26]:
import numpy as np

In [27]:
product_id=[1,2,3,4,5]
product_name=["Iphone","Moto","Realme","Mi","Jio"]
product_price=[70000,20000,30000,25000,2000]
Data={'product_id':product_id,'product_name':product_name,'product_price':product_price}
s=pd.DataFrame(Data)
s

   product_id product_name  product_price
0           1       Iphone          70000
1           2         Moto          20000
2           3       Realme          30000
3           4           Mi          25000
4           5          Jio           2000

In [29]:
s["product_id"]

0    1
1    2
2    3
3    4
4    5
Name: product_id, dtype: int64

In [30]:
s["product_name"]

0    Iphone
1      Moto
2    Realme
3        Mi
4       Jio
Name: product_name, dtype: object

In [31]:
s["product_price"]

0    70000
1    20000
2    30000
3    25000
4     2000
Name: product_price, dtype: int64

In [32]:
s.iloc[0]

product_id            1
product_name     Iphone
product_price     70000
Name: 0, dtype: object

In [33]:
s.loc[1]

product_id           2
product_name      Moto
product_price    20000
Name: 1, dtype: object

In [34]:
for row in s.iterrows():
    print(row)

(0, product_id            1
product_name     Iphone
product_price     70000
Name: 0, dtype: object)
(1, product_id           2
product_name      Moto
product_price    20000
Name: 1, dtype: object)
(2, product_id            3
product_name     Realme
product_price     30000
Name: 2, dtype: object)
(3, product_id           4
product_name        Mi
product_price    25000
Name: 3, dtype: object)
(4, product_id          5
product_name      Jio
product_price    2000
Name: 4, dtype: object)

In [35]:
s.loc[1:3,["product_price"]]

   product_price
1          20000
2          30000
3          25000

In [36]:
s.iloc[2:5]

   product_id product_name  product_price
2           3       Realme          30000
3           4           Mi          25000
4           5          Jio           2000

In [37]:
s.iloc[1,[2]]

product_price    20000
Name: 1, dtype: object

In [38]:
s.loc[1:3,['product_id']]

   product_id
1           2
2           3
3           4

In [39]:
subject=['python','datascience','dbms']
students=['riya','siya','kiya','jiya']
data=[[10,20,30,],[50,70,60],[10,20,30,],[80,90,98]]
r=pd.DataFrame(data,index=students,columns=subject)
r

      python  datascience  dbms
riya      10           20    30
siya      50           70    60
kiya      10           20    30
jiya      80           90    98

In [40]:
r['python']<40

riya     True
siya    False
kiya     True
jiya    False
Name: python, dtype: bool

In [41]:
r.loc[r.python<40,'python']=41
r

      python  datascience  dbms
riya      41           20    30
siya      50           70    60
kiya      41           20    30
jiya      80           90    98

In [42]:
r+2

      python  datascience  dbms
riya      43           22    32
siya      52           72    62
kiya      43           22    32
jiya      82           92   100

In [43]:
x=r['python']>50
x

riya    False
siya    False
kiya    False
jiya     True
Name: python, dtype: bool